tentareco/app/controllers/accounts_controller.rb

UPDATE `users` SET `full_name` = '豊島哲也', `updated_at` = '2019-02-13 06:06:57' WHERE `users`.`id` = 7
---
  def update
    @user = current_user
    @user.assign_attributes(account_params)
    if @user.save