tentareco/app/controllers/application_controller.rb

class ApplicationController < ActionController::Base
  private def current_user
    User.find_by(id: session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1