tentareco/app/controllers/passwords_controller.rb

  def update
    @user = current_user
    a_c_p = password_params[:current_password]

    if a_c_p.present?
      if @user.authenticate(a_c_p)
      @user.assign_attributes(password_params)
        if @user.save
---
UPDATE `users` SET `password_digest` = '$2a$10$2YOiv8lDUsFYC3Q/VdMzneA63ldrBRUntWNai/zBEyrCf8yO/svcO', `updated_at` = '2019-02-14 08:30:33' WHERE `users`.`id` = 7