tentareco/app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'Tetsu' LIMIT 1
---
  def create
    user_obj = User.find_by(name: params[:name])