tentareco/app/controllers/track_images_controller.rb

  before_action :login_required

  before_action do
    @track = current_user.tracks.find(params[:track_id])
---
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`user_id` = 13 AND `tracks`.`id` = 16 LIMIT 1

  def create
    @image = @track.images.build(image_params)
    if @image.save
---
INSERT INTO `track_images` (`track_id`, `alt_text`, `created_at`, `updated_at`) VALUES (16, '空', '2019-02-28 01:45:17', '2019-02-28 01:45:17')

  def update
    @image = @track.images.find(params[:id])
    @image.assign_attributes(image_params)
    if @image.save
---
UPDATE `track_images` SET `updated_at` = '2019-02-28 02:03:11' WHERE `track_images`.`id` = 1

  def destroy
    @image = @track.images.find(params[:id])
    @image.destroy
---
DELETE FROM `track_images` WHERE `track_images`.`id` = 2