tentareco/app/controllers/tracks_controller.rb

  def index
    if params[:user_id]
      @user = User.find(params[:user_id])
      @tracks = @user.tracks
    else
      @tracks = Track.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 15 LIMIT 1
SELECT `tracks`.* FROM `tracks` WHERE `tracks`.`user_id` = 7

  def show
    @track = Track.find(params[:id])
---
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 15 LIMIT 1

  def edit
    @track = current_user.tracks.find(params[:id])
---
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`user_id` = 7 AND `tracks`.`id` = 12 LIMIT 1

  def create
    @track = Track.new(track_params)
    @track.artist = current_user
    if @track.save
---
INSERT INTO `tracks` (`user_id`, `title`, `body`, `posted_at`, `created_at`, `updated_at`) VALUES (7, 'あああ', 'あああ', '2019-02-18 08:49:00', '2019-02-18 08:49:28', '2019-02-18 08:49:28')

  def update
    @track = current_user.tracks.find(params[:id])
    @track.assign_attributes(track_params)
    if @track.save
---
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`user_id` = 7 AND `tracks`.`id` = 12 LIMIT 1
UPDATE `tracks` SET `body` = 'いいい', `updated_at` = '2019-02-18 09:28:49' WHERE `tracks`.`id` = 12

  def destroy
    @track = current_user.tracks.find(params[:id])
    @track.destroy
---
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`user_id` = 7 AND `tracks`.`id` = 1 LIMIT 1
DELETE FROM `tracks` WHERE `tracks`.`id` = 1

  def like
    @track = Track.find(params[:id])
    current_user.clapped_tracks << @track
---
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 18 LIMIT 1
INSERT INTO `claps` (`user_id`, `track_id`, `created_at`, `updated_at`) VALUES (13, 18, '2019-03-06 09:10:13', '2019-03-06 09:10:13')

  def unlike
    current_user.clapped_tracks.destroy(Track.find(params[:id]))
---
DELETE FROM `claps` WHERE `claps`.`id` = 11
SELECT  `tracks`.* FROM `tracks` WHERE `tracks`.`id` = 18 LIMIT 1
SELECT `claps`.* FROM `claps` WHERE `claps`.`user_id` = 13 AND `claps`.`track_id` = 18