tentareco/app/views/parts/_sidebar.html.erb

<h2>最新の発表</h2>
<% tracks = Track.order(posted_at: :desc).limit(5) %>
---
SELECT  `tracks`.* FROM `tracks` ORDER BY `tracks`.`posted_at` DESC LIMIT 5