tentareco/app/views/tracks/_footer.html.erb

SELECT COUNT(*) FROM `claps` WHERE `claps`.`track_id` = 16
---
  </li>
  <% if (num = track_footer.claps.count) > 0 %>